# Direct Context 3DHandle Settings Set Visibility Method

Source: https://www.revitapidocs.com/2026/e9cfafdf-15ab-d457-9248-e9bb4d082272.htm

---

| Direct Context 3DHandle Settings Set Visibility Method |
| --- |

Visibility of the handle and the associated DirectContext3D graphics.
 A value of true means that the graphics are visible.
**Namespace:** Autodesk.Revit.DB.DirectContext3D
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetVisibility(
	bool visibility
)
```

```
Public Sub SetVisibility (
	visibility As Boolean
)
```

```
public:
void SetVisibility(
	bool visibility
)
```

```
member SetVisibility :
        visibility : bool -> unit
```

#### Parameters

visibility Boolean
:   Visibility of the handle and the associated DirectContext3D graphics.
 A value of true means that the graphics are visible.

See Also

#### Reference

DirectContext3DHandleSettings Class Autodesk.Revit.DB.DirectContext3D Namespace